tutorials/SydneyBluffBodyFlame/0.org/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    jet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      no;
    }
    bluffBody
    {
        type            slip;
    }
    coflow
    {
        type            timeVaryingMappedFixedValue;
        setAverage      no;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            slip;
    }
    outerWall
    {
        type            slip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
