tutorials/SydneyBluffBodyFlame/0.org/rho
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.200768e+00;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    jet
    {
        type            fixedValue;
        value           uniform 3.741743e-01;
    }
    bluffBody
    {
        type            zeroGradient;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 1.200768e+00;
    }
    outerWall
    {
        type            zeroGradient;
    }
    outflow
    {
        type            zeroGradient;
    }
    axis
    {
        type            slip;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
