tutorials/SydneyBluffBodyFlame/constant/RASProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        kEpsilon;

turbulence      on;

printCoeffs     on;

kEpsilonCoeffs {
  C1    1.6;
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
