tutorials/SydneyBluffBodyFlame/constant/flamelet/z
FoamFile
{
    version     2.0;
    format      ascii;
    class       scalarList;
    object      z;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

300
(
    0.0000000e+00
    3.3444816e-03
    6.6889632e-03
    1.0033445e-02
    1.3377926e-02
    1.6722408e-02
    2.0066890e-02
    2.3411371e-02
    2.6755853e-02
    3.0100334e-02
    3.3444816e-02
    3.6789298e-02
    4.0133779e-02
    4.3478261e-02
    4.6822742e-02
    5.0167224e-02
    5.3511706e-02
    5.6856187e-02
    6.0200669e-02
    6.3545151e-02
    6.6889632e-02
    7.0234114e-02
    7.3578595e-02
    7.6923077e-02
    8.0267559e-02
    8.3612040e-02
    8.6956522e-02
    9.0301003e-02
    9.3645485e-02
    9.6989967e-02
    1.0033445e-01
    1.0367893e-01
    1.0702341e-01
    1.1036789e-01
    1.1371237e-01
    1.1705686e-01
    1.2040134e-01
    1.2374582e-01
    1.2709030e-01
    1.3043478e-01
    1.3377926e-01
    1.3712375e-01
    1.4046823e-01
    1.4381271e-01
    1.4715719e-01
    1.5050167e-01
    1.5384615e-01
    1.5719064e-01
    1.6053512e-01
    1.6387960e-01
    1.6722408e-01
    1.7056856e-01
    1.7391304e-01
    1.7725753e-01
    1.8060201e-01
    1.8394649e-01
    1.8729097e-01
    1.9063545e-01
    1.9397993e-01
    1.9732441e-01
    2.0066890e-01
    2.0401338e-01
    2.0735786e-01
    2.1070234e-01
    2.1404682e-01
    2.1739130e-01
    2.2073579e-01
    2.2408027e-01
    2.2742475e-01
    2.3076923e-01
    2.3411371e-01
    2.3745819e-01
    2.4080268e-01
    2.4414716e-01
    2.4749164e-01
    2.5083612e-01
    2.5418060e-01
    2.5752508e-01
    2.6086957e-01
    2.6421405e-01
    2.6755853e-01
    2.7090301e-01
    2.7424749e-01
    2.7759197e-01
    2.8093645e-01
    2.8428094e-01
    2.8762542e-01
    2.9096990e-01
    2.9431438e-01
    2.9765886e-01
    3.0100334e-01
    3.0434783e-01
    3.0769231e-01
    3.1103679e-01
    3.1438127e-01
    3.1772575e-01
    3.2107023e-01
    3.2441472e-01
...
)

// *********************** vim: set ft=cpp et sw=4 : *********************** //
