tutorials/SydneyBluffBodyFlame/constant/polyMesh/blockMeshDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

/*****************************************************************************\
   3                                                     7
    +----------------------------------------------------+
    \----___      11                                      \----___
     \      ---__+_________________________________________\___________+ 15
      \          /                                          \          /
     2 +        + 10                                       6 +        + 14
        \      /                                              \      /
       1 +    + 9                                            5 +    + 13
          \  /                                                  \  /
         0 ++-8------------------------------------------------4-++ 12
\*****************************************************************************/

convertToMeters 1e-3;

vertices
(
    (           0    0.1494292  -0.01307336) //  0
    (           0      1.79315   -0.1568803) //  1
    (           0     24.90487    -2.178894) //  2
    (           0     149.4292    -13.07336) //  3
    (         300    0.1494292  -0.01307336) //  4
    (         300      1.79315   -0.1568803) //  5
    (         300     24.90487    -2.178894) //  6
    (         300     149.4292    -13.07336) //  7
    (           0    0.1494292   0.01307336) //  8
    (           0      1.79315    0.1568803) //  9
    (           0     24.90487     2.178894) //  10
    (           0     149.4292     13.07336) //  11
    (         300    0.1494292   0.01307336) //  12
    (         300      1.79315    0.1568803) //  13
    (         300     24.90487     2.178894) //  14
    (         300     149.4292     13.07336) //  15
);

blocks
(
    hex ( 0  8 12  4  1  9 13  5) (1 80  6) simpleGrading (1 10  1)
    hex ( 1  9 13  5  2 10 14  6) (1 80 40) simpleGrading (1 10  3)
    hex ( 2 10 14  6  3 11 15  7) (1 80 34) simpleGrading (1 10 10)
);

edges
(
);

patches
(
    wedge front
    (
        ( 8 12 13  9)
        ( 9 13 14 10)
        (10 14 15 11)
    )
    wedge back
    (
        ( 0  1  5  4)
        ( 1  2  6  5)
        ( 2  3  7  6)
    )
    patch jet
    (
        ( 0  8  9  1)
    )
    patch bluffBody
    (
        ( 1  9 10  2)
    )
    patch coflow
    (
        ( 2 10 11  3)
    )
    patch outerWall
    (
        ( 3 11 15  7)
    )
    patch outflow
    (
        ( 4  5 13 12)
        ( 5  6 14 13)
        ( 6  7 15 14)
    )
    patch axis
    (
        ( 0  4 12  8)
    )
);

// *********************** vim: set ft=cpp et sw=4 : *********************** //
