tutorials/SydneyBluffBodyFlame/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pdfSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e5;

deltaT          1;

writeInterval   110;

purgeWrite      2;

writeControl    timeStep;

writeFormat     binary;

writePrecision  8;

writeCompression compressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

nFVSubCycles    10;

nPDFSubCycles   100;

functions
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type        probes;

        // Name of the directory for probe data
        name        probes;
        probeLocations
        (
            ( 25.0e-3  1.5e-4 0)   // Db/2, 0
            ( 50.0e-3  1.5e-4 0)   // Db,   0
            (100.0e-3  1.5e-4 0)   // 2Db,  0
            ( 25.0e-2  1.5e-4 0)   // 5Db,  0
            ( 25.0e-3 13.4e-3 0)   // Db/2, mid-bb
            ( 50.0e-3 13.4e-3 0)   // Db,   mid-bb
            (100.0e-3 13.4e-3 0)   // 2Db,  mid-bb
            ( 25.0e-2 13.4e-3 0)   // 5Db,  mid-bb
            ( 25.0e-3 25.0e-3 0)   // Db/2, Db/2
            ( 50.0e-3 25.0e-3 0)   // Db,   Db/2
            (100.0e-3 25.0e-3 0)   // 2Db,  Db/2
            ( 25.0e-2 25.0e-3 0)   // 5Db,  Db/2
        );

        // Fields to be probed
        fields ( rho pndCloudPDF z zzCov T TTCov U UCloudPDF k kCloudPDF );

        // Write at same frequency as fields
        outputControl   timeStep;
        outputInterval  10;
    }
}

// *********************** vim: set ft=cpp et sw=4 : *********************** //
