tutorials/SydneyBluffBodyFlame/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 6;

method          metis;

simpleCoeffs
{
    n               ( 2 2 1 );
    delta           0.001;
}

metisCoeffs
{
    processorWeights 6{1};
}

distributed     no;

roots           ( );

// *********************** vim: set ft=cpp et sw=4 : *********************** //
